name: "large_layer_test"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 20; dim: 16; dim: 33; dim: 33; } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"

  convolution_param {
    num_output: 26
    pad: 1
    kernel_size: 5
    stride: 3
    group: 2
  }
}
