layer {
    input_height: 28
    input_width: 28
    num_inputs: 17
    num_outputs: 27

    conv: {
        worker_factor: 1
        conv_folding_factor: 3
        kernel_folding_factor: 49
        bram_factor: 459

        stride: 5
        pad: 2
        kernel_size: 7
    }
}
