layer {
    input_height: 224
    input_width: 224
    num_inputs: 96
    num_outputs: 256

    conv: {
        kernel_size: 5
        pad: 1

        worker_factor: 1
        conv_folding_factor: 1
        kernel_folding_factor: 1
    }
}
