layer {
    input_height: 224
    input_width: 224
    num_inputs: 256
    num_outputs: 384

    conv: {
        kernel_size: 3
        pad: 1

        worker_factor: 1
        conv_folding_factor: 1
        kernel_folding_factor: 1
    }
}
