layer {
    input_height: 28
    input_width: 28
    num_inputs: 16
    num_outputs: 16

    activation: Relu

    conv: {
        kernel_size: 7

        worker_factor: 8
        conv_folding_factor: 4
        kernel_folding_factor: 25
        look_ahead: 1
    }
}
layer {
    num_inputs: 16
    num_outputs: 16

    activation: Relu

    conv: {
        kernel_size: 7

        worker_factor: 8
        conv_folding_factor: 4
        kernel_folding_factor: 25
        look_ahead: 1
    }
}
