layer {
    input_height: 100
    input_width: 100
    num_inputs: 200
    num_outputs: 200

    pool: {
        channel_folding_factor: 200

        type: Max
        dim: 3
        stride: 2
    }
}
