layer {
    input_height: 224
    input_width: 224
    num_inputs: 384
    num_outputs: 384

    pool: {
        channel_folding_factor: 128

        type: Max
        kernel_size: 3
        stride: 2
    }
}
