layer {
    input_height: 28
    input_width: 28
    num_inputs: 30
    num_outputs: 32
    activation: Relu

    conv: {
        kernel_size: 5

        worker_factor: 6
        conv_folding_factor: 8
        kernel_folding_factor: 25
        look_ahead: 1
    }
}
