layer {
    input_height: 28
    input_width: 28
    num_inputs: 30
    num_outputs: 32

    conv: {
        activation: Relu
        kernel_size: 5

        worker_factor: 10
        conv_folding_factor: 13
        kernel_folding_factor: 13
    }
}
