layer {
    input_height: 28
    input_width: 28
    num_inputs: 1
    num_outputs: 20

    conv: {
        worker_factor: 1
        conv_folding_factor: 10
        kernel_folding_factor: 13

        kernel_size: 5
        activation: Relu
    }
}
