layer {
    input_height: 33
    input_width: 33
    num_inputs: 16
    num_outputs: 26

    conv: {
        pad: 1
        stride: 3
        kernel_size: 5
        group: 2

        worker_factor: 1
        conv_folding_factor: 13
        kernel_folding_factor: 25
    }

    activation: None
}
